app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "username", "ref_id", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('test', NULL, 'test@testlc.com', 'test', NULL, '2012-03-12 04:24:56.989649', '2012-03-12 04:24:56.989649', 'be031c721ae795b5fe588e145336bbc85cd20d01e039733cfdcbcb3ea4c0212c', '6f7800b8ada56b2013e983264cac64d3b2e538d6c7a22d700d64850a9ce9a31e')